---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalEquipment
source: html/a93a0589-784b-27a3-c7d0-1122921a7a23.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalEquipment

Provides access to the Electrical Equipment in Autodesk Revit.

## Syntax (C#)
```csharp
public class ElectricalEquipment : MEPModel
```